-- phpMyAdmin SQL Dump
-- version 4.9.5
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Feb 06, 2021 at 07:06 AM
-- Server version: 10.3.25-MariaDB
-- PHP Version: 7.3.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `dailyro3_news`
--

-- --------------------------------------------------------

--
-- Table structure for table `city`
--

CREATE TABLE `city` (
  `city_id` int(150) NOT NULL,
  `state_id` int(150) NOT NULL,
  `city_name` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `city`
--

INSERT INTO `city` (`city_id`, `state_id`, `city_name`) VALUES
(1, 7, 'lahore'),
(2, 7, 'Faisalabad'),
(3, 1, 'new york'),
(4, 2, 'buffaio'),
(5, 2, 'birmingham'),
(6, 2, 'montgomary'),
(7, 3, 'los angeles'),
(8, 3, 'san'),
(9, 5, 'toranto');

-- --------------------------------------------------------

--
-- Table structure for table `contact`
--

CREATE TABLE `contact` (
  `id` int(100) NOT NULL,
  `name` varchar(100) NOT NULL,
  `email` varchar(100) NOT NULL,
  `message` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `contact`
--

INSERT INTO `contact` (`id`, `name`, `email`, `message`) VALUES
(17, 'MUbashar', 'mubasharbinafzal@gmail.com', 'Assalam -o- Alikum \r\nwelcome to dailyrozgarnews'),
(18, 'Raleigh Topp', 'raleigh@stardatagroup.com', 'It is with sad regret to inform you StarDataGroup.com is shutting down.\r\nIt has been a tough year all round and we decided to go out with a bang!\r\n\r\nAny group of databases listed below is $49 or $149 for all 16 databases in this one time offer.\r\nYou can purchase it at www.StarDataGroup.com and view samples.\r\n\r\n- LinkedIn Database\r\n 43,535,433 LinkedIn Records\r\n\r\n- USA B2B Companies Database\r\n 28,147,835 Companies\r\n\r\n- Forex\r\n Forex South Africa 113,550 Forex Traders\r\n Forex Australia 135,696 Forex Traders\r\n Forex UK 779,674 Forex Traders\r\n\r\n- UK Companies Database\r\n 521,303 Companies\r\n\r\n- German Databases\r\n German Companies Database: 2,209,191 Companies\r\n German Executives Database: 985,048 Executives\r\n\r\n- Australian Companies Database\r\n 1,806,596 Companies\r\n\r\n- UAE Companies Database\r\n 950,652 Companies\r\n\r\n- Affiliate Marketers Database\r\n 494,909 records\r\n\r\n- South African Databases\r\n B2B Companies Database: 1,462,227 Companies\r\n Directors Database: 758,834 Directors\r\n Healthcare Data'),
(19, 'Eric Jones', 'ericjonesonline@outlook.com', 'My name’s Eric and I just came across your website - dailyrozgarnews.com - in the search results.\r\n\r\nHere’s what that means to me…\r\n\r\nYour SEO’s working.\r\n\r\nYou’re getting eyeballs – mine at least.\r\n\r\nYour content’s pretty good, wouldn’t change a thing.\r\n\r\nBUT…\r\n\r\nEyeballs don’t pay the bills.\r\n\r\nCUSTOMERS do.\r\n\r\nAnd studies show that 7 out of 10 visitors to a site like dailyrozgarnews.com will drop by, take a gander, and then head for the hills without doing anything else.\r\n\r\nIt’s like they never were even there.\r\n\r\nYou can fix this.\r\n\r\nYou can make it super-simple for them to raise their hand, say, “okay, let’s talk” without requiring them to even pull their cell phone from their pocket… thanks to Talk With Web Visitor.\r\n\r\nTalk With Web Visitor is a software widget that sits on your site, ready and waiting to capture any visitor’s Name, Email address and Phone Number.  It lets you know immediately – so you can talk to that lead immediately… without delay… BEFORE they head for those h');

-- --------------------------------------------------------

--
-- Table structure for table `country`
--

CREATE TABLE `country` (
  `country_id` int(150) NOT NULL,
  `country_name` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `country`
--

INSERT INTO `country` (`country_id`, `country_name`) VALUES
(1, 'usa'),
(2, 'canada'),
(3, 'pakistan'),
(4, 'india ');

-- --------------------------------------------------------

--
-- Table structure for table `feedback`
--

CREATE TABLE `feedback` (
  `id` int(150) NOT NULL,
  `name` varchar(150) NOT NULL,
  `email` varchar(150) NOT NULL,
  `feedback1` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `feedback`
--

INSERT INTO `feedback` (`id`, `name`, `email`, `feedback1`) VALUES
(1, 'mubashar', 'mubasharbinafzal@gmail.com', 'good article'),
(2, 'haroon', 'haroonbinafzal@gmail.com', 'good article');

-- --------------------------------------------------------

--
-- Table structure for table `news`
--

CREATE TABLE `news` (
  `id` int(11) NOT NULL,
  `title` varchar(500) CHARACTER SET utf8 NOT NULL,
  `description` varchar(5000) CHARACTER SET utf8 NOT NULL,
  `type` varchar(200) NOT NULL,
  `image` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `news`
--

INSERT INTO `news` (`id`, `title`, `description`, `type`, `image`) VALUES
(75, 'ایم کیو ایم کا لاپتہ کارکن 4 سال بعد قتل، لاش کی شناخت ہوگئی', 'کراچی (ویب ڈیسک) سرجانی ٹاﺅن تھانے کی حدود نا رد رن بائی پاس سے ملنے والی تشدد زدہ لاش ایم کیو ایم کارکن کی نکلی۔لاش کی شناخت کلیم عرف شاہدکے نام سے ہوئی ہے۔\r\n\r\n\r\nپولیس کے مطابق اہل خانہ کا کہنا ہے کہ مقتول ایم کیو ایم کا کارکن اور موبائل ریپئرنگ کا کام کرتا تھا، اور مقتول کی اہلیہ عالیہ زوجہ محمد شاہد نے شوہر کے لاپتہ ہونے کا مقدمہ نمبر 78/2019 سپر مارکیٹ تھانے میں درج کرا دیا تھا۔\r\n\r\n اہلیہ کے مطابق مقتول کلیم عرف شاہد ایک بیٹی کا باپ اورمکان نمبر 1/281 رحمانیہ مسجد لیاقت آباد کا رہائشی تھا۔ \r\n\r\nقومی سکواڈکی کوروناٹیسٹنگ کلیئرآگئی،مینجڈآئسولیشن چھوڑنےکی اجازت مل گئی\r\n9دسمبر 2016 کے روز میرے شوہر کے موبائل پر کسی کی کال آئی اور وہ گھر سے چلے گئے،کافی دیر تک نہ آنے پر موبائل فون پر کال کی تو موبائل بند جا رہا تھا۔\r\n\r\nرات ہونے پر اہنے طور پر معلومات کی تو پتا چلا کچھ لوگ شوہر کو گاڑی میں بٹھاکر لے گئے، پولیس کے مطابق واقعہ کی تفتیش شروع کردی گئی ہے۔', 'Latest_News', 'news-1607321167-8621.jpg'),
(76, 'مریم نواز اور حمزہ شہباز کے درمیان شدید منہ ماری ہوئی: فیاض چوہان کا دعویٰ', 'وزیر کالونیز و جیل خانہ جات پنجاب فیاض الحسن چوہان نے دعویٰ کیا ہے کہ بیگم شمیم اختر کے جنارے سے اگلے روز مریم نواز اور حمزہ شہباز کے درمیان شدید منہ ماری ہوئی۔\r\n\r\nمریم نواز کے بیان پر ردعمل دیتے ہوئے صوبائی وزیر کا کہنا تھا کہ بیگم صفدر اعوان وزیراعظم عمران خان سے استعفیٰ مانگ رہی ہیں لیکن حمزہ شہباز نے ان سے استعفیٰ مانگ لیا ہے۔\r\n\r\nفیاض چوہان کا کہنا تھا ان کے شاہینوں کے مطابق حمزہ شہباز نے بیگم صفدر اعوان کو ان کے بیانیے سے ہٹنے کے لیے خدا کے واسطے دیے، شریف خاندان خود ٹوٹ پھوٹ کا شکار ہے، یہ اپوزیشن اور ملک کوکیا متحد رکھےگا۔', 'Politics', '236478_9037023_updates.jpg'),
(77, 'پاکستان: کورونا سے مزید 37 اموات، 5 ماہ کے بعد ایک دن میں ریکارڈ کیسز رپورٹ', '24 گھنٹوں کے دوران 3795 افراد میں کورونا وائرس کی تصدیق ہوئی جب کہ وائرس سے مزید 37 افراد انتقال کرگئے۔', 'Health', 'l_236475_093247_updates_(1).jpg'),
(78, 'نیوزی لینڈ میں پاکستانی اسکواڈ کے تمام ٹیسٹ کلیئر ہوگئے', 'نیوزی لینڈ میں پاکستانی اسکواڈ کے تمام ٹیسٹ کلیئر ہوگئے جس کے بعد قومی اسکواڈ کو مینجڈ آئسولیشن چھوڑنے کی اجازت مل گئی۔\r\n\r\nپاکستانی اسکواڈ کی بارہویں روز کی کورونا ٹیسٹنگ گزشتہ روز ہوئی جس میں 44 ارکان کی کورونا ٹیسٹنگ کی گئی تھی۔\r\n\r\nپی سی بی کے مطابق پاکستانی اسکواڈ کے ٹیسٹ کلیئر ہونے کے بعد انہیں مینجڈ آئسولیشن چھوڑنے کی اجازت مل گئی ہے جس کے بعد اسکواڈ میں شامل 51 ارکان کل کرائسٹ چرچ کی مینجڈ آئسولیشن چھوڑ دیں گے جب کہ پہلے مرحلے میں کورونامثبت آنے والے ارکان بھی مینجڈ آئسولیشن چھوڑیں گے۔\r\n\r\nپی سی بی کے مطابق چھٹے اور نویں روز کورونا کیس رپورٹ ہونے والے 2 ارکان یہیں آئسولیشن پوری کریں گے اور یہ دونوں ارکان آئسولیشن کی مدت مکمل کرکے کوئنز ٹاؤن میں اسکواڈ جوائن  کریں گے۔\r\n\r\nپی سی بی کا کہنا ہےکہ قومی اسکواڈ کل مینجڈ آئسولیشن چھوڑ کر قریبی ہوٹل پہنچ جائے گا جب کہ آئسولیشن چھوڑنے کے بعد اسکواڈ پر کورونا ایس او پیز لاگو نہیں ہوں گے۔\r\n\r\n پی سی بی حکام کے مطابق قومی اسکواڈ کا آخری ہیلتھ چیک اپ کل ہوگا جس کے بعد اسکواڈ کے 51 ارکان کل کوئنز ٹاؤن روانہ ہوں گے۔', 'Mixed', '236478_9037023_updates1.jpg'),
(79, 'اداکارہ زینب جمیل نے بھی شوبز سے کنارہ کشی اختیار کرلی', 'پاکستان ڈرامہ انڈسٹری میں مختلف کرداروں کے لیے مشہور اداکارہ و ماڈل زینب جمیل نے بھی اسلام کی خاطر شوبز چھوڑنے کا اعلان کردیا۔\r\n\r\n31 سالہ اداکارہ و ماڈل زینب جمیل نے شوبز چھوڑنے کا اعلان فوٹو شیئرنگ   ایپ انسٹاگرام  کے ذریعے کیا۔\r\n\r\nانسٹاگرام پوسٹ پر اداکارہ کا کہنا تھا کہ مجھے یہ اعلان کرتے ہوئے فخر ہے کہ میں بطور ماڈل اور اداکارہ اپنا کیرئیر جاری نہیں رکھنا چاہتی،الحمداللہ', 'Latest_News', '236501_1241374_updates.jpg'),
(80, 'چین بھارت کے مزید علاقوں پر قابض، سیٹلائٹ تصاویر نے بھارت کے ہوش اڑادیے', 'چین بھارتی ریاست ارونا چل پردیش میں مزید تین گاؤں پر قابض ہوگیا لیکن بھارت کو خبر تک نہ ہوئی۔\r\n\r\nنئی سیٹلائٹ تصویروں نے بھارت کے ہوش اُڑا کررکھ دیے جس کے بعد بھارت کی طرف سے اس بات کی تصدیق کی گئی ہے کہ چین نے ڈوکلام سے صرف 7 کلومیٹر دور مزید علاقوں پر قبضہ کرلیا ہے۔\r\n\r\nیہ بھی پڑھیں\r\nبھارت کی چین اور پاکستان کو گیدڑ بھبکیاں\r\nبھارت اور چین کے درمیان سرحدی تنازع ایک بار پھر گرم\r\nبھارتی فوجیوں کی چینی فوج کے ہاتھوں پٹائی کی نئی ویڈیو سامنے آگئی\r\nسیٹلائیٹ تصویروں میں دیکھا جاسکتا ہے کہ چین نے بھارت اور بھوٹان کے ساتھ متنازع علاقے میں یہ گاؤں بسائے ہیں اور متنازع علاقے میں 50 سے زائد تعمیرات مکمل کرلی ہیں۔\r\n\r\nچین کی جانب سے بھارت کے گاؤں آباد کرنے کے حوالے سے بھارتی بیان سامنے آیا ہے جس میں کہا گیا ہےکہ چین سوچے سمجھے منصوبے کے تحت متنازع علاقے میں ہان اور تبت کے باشندوں کو آباد کر رہا ہے۔\r\n\r\nدوسری جانب چین کا مؤقف ہے کہ یہ علاقہ چین سے ہی تعلق رکھتا ہے اور تاریخی طور پر جنوبی تبت کا حصہ ہے۔', 'Latest_News', '236487_7435257_updates_(1).jpg'),
(81, 'مریم نواز کے کندھے پر ہاتھ رکھنے والے کارکن پر سکیورٹی گارڈ کا تشدد', 'لاہور میں عوامی رابطہ ریلی کے دوران مریم نواز کے کندھے پر ہاتھ رکھنے والے کارکن کو سکیورٹی گارڈ نے تشدد کا نشانہ بنا ڈالا جب کہ شاہدرہ میں مریم نواز کے خطاب کے بعد پنڈال سے کسی نے شاخ اچھال دی جو مریم نواز کے ماتھے پر لگی۔\r\n\r\nمریم نواز 13 دسمبر کے جلسے کی عوامی رابطہ ریلی کی قیادت کرتے ہوئے داروغہ والا میں شیخ روحیل اصغر کے استقبالیہ کیمپ پہنچیں تو ایک کارکن نے ان کے کندھے پر ہاتھ رکھ دیا جس پر مریم نواز کے سکیورٹی گارڈ اور دیگر افراد نےاس شخص کو تھپڑ مارکر تشدد کا نشانہ بنایا۔', 'Latest_News', '236629_4533635_updates.jpg'),
(82, 'مفتی زرولی خان کا انتقال کورونا سے نہیں ہوا: قاری عثمان', 'قاری عثمان کے مطابق مفتی زرولی خان کو اتوار کی شام کو طبیعت خراب ہونےپر معمول کے چیک آپ کے لیے اسپتال لے جایا گیا تھاجہاں وہ 24 گھنٹے داخل رہنے کے بعد اللہ کو پیارے ہو گئے۔\r\n\r\nواضح رہے کہ ترجمان انڈس اسپتال کے مطابق مفتی زر ولی کورونا کے سبب انڈس اسپتال میں زیر علاج تھے تاہم قاری محمد عثمان نے اس کی تردید کی ہے۔\r\n\r\nشیخ الحدیث مفتی زر ولی خان جامعہ احسن العلوم کراچی کے مہتمم تھے۔\r\n\r\nمفتی زر ولی خان پھپیڑوں کے عارضے میں مبتلا تھے اور کافی عرصے سے آکسیجن پر تھے۔\r\n\r\nمولانا زر ولی خان 1953 میں جہانگیرہ میں پیدا ہوئے اور انہوں نے دینی تعلیم بنوری ٹاؤن سے حاصل کی جس کے بعد 1978 میں گلشن اقبال میں مدرسہ احسن العلوم کی بنیاد رکھی جو اب جامعہ احسن العلوم کے نام سے پہچانی جاتی ہے۔', 'Health', '236618_3890556_updates.jpg'),
(83, 'مشیروں اور معاونین سے متعلق عدالتی فیصلے کے بعد حکومت نئی مشکل میں پھنس گئی', 'اسلام آباد ہائیکورٹ کے مشیروں و معاونین کے کابینہ کمیٹیوں کی سربراہی اور رکن ہونےکو غیر قانونی قرار دینے کے فیصلے کے بعد حکومت ایک اور قانونی مشکل میں پھنس گئی۔\r\n\r\nاسلام آباد ہائیکورٹ کے مشیروں کے کابینہ کمیٹیوں کی سربراہی اور رکن ہونا غیر قانونی قرار دینے کے فیصلے کے بعد جیو نیوز نے سرکاری مؤقف اور موجودہ کابینہ کمیٹیوں کی تفصیلات حاصل کر لیں جس کے مطابق تمام کابینہ کمیٹوں میں مشیر یا معاونین خصوصی بطور چیئرمین یا رکن شامل ہیں۔\r\n\r\nیہ تمام کابینہ کمیٹیاں وزیراعظم عمران خان نے رولز آف بزنس 1973 کے تحت حاصل اختیار کے تحت تشکیل دیں۔\r\n\r\nذرائع کے مطابق اسلام آباد ہائیکورٹ کے مشیروں اور معاونین کے کابینہ کمیٹیوں کی سربراہی اور رکن ہونا غیر قانونی قرار دینے کا فیصلے کے بعد حکومت ایک اور اہم قانونی مشکل میں پھنس گئی ہے۔\r\n\r\nموجودہ تقریباً تمام کابینہ کمیٹوں میں وزیراعظم کے مشیر یا معاونین خصوصی بطور چیئرمین یا رکن شامل ہیں مگر عدالتی فیصلے کے بعد یہ سب عملاً غیر فعال ہو چکے ہیں۔\r\n\r\nذرائع کے مطابق کل 7 کابینہ کمیٹیوں میں سے 3 کے چیئرمین مشیر خزانہ ہیں جبکہ مشیر خزانہ حفیظ شیخ کابینہ کی اقتصادی رابطہ کمیٹی اور کابینہ کمیٹی برائے نجکاری کے چیئرمین بھی ہیں، مشیر خزانہ کابینہ کمیٹی سرکاری ملکیتی اداروں کے بھی چیئرمین اور قومی اقتصادی کونسل کی ایگزیکٹو کمیٹی (ایکنک)کے چیئرمین بھی ہیں۔حفیظ شیخ کابینہ کی توانائی اور سی پیک کمیٹیوں میں بطور رکن بھی شامل ہیں۔\r\n\r\nذرائع کا بتانا ہے کہ مشیر تجارت عبد الرزاق داؤد ای سی سی، کابینہ کمیٹی برائے نجکاری، کابینہ کمیٹی برائے سرکاری ملکیتی اداروں، اور کابینہ کمیٹی برائے توانائی میں بھی بطور رکن شامل ہیں۔\r\n\r\nاسی طرح مشیر اصلاحات ڈاکٹر عشرت حسین ای سی سی، کابینہ کمیٹی نجکاری اور سی پیک اور کابینہ کمیٹی ادارہ جاتی اصلاحات میں بھی بطور رکن شامل ہیں۔\r\n\r\nمشیر پارلیمانی امور بابر اعوان کابینہ کمیٹی برائے قانون سازی میں بطور رکن، مشیر مرزا شہزاد اکبر کابینہ کمیٹی برائے قانون سازی میں بطور رکن، معاون خصوصی اسٹیبلشمنٹ ارباب شہزاد کابینہ کمیٹی رائے ادارہ جاتی اصلاحات میں رکن کے طور پر شامل ہیں۔\r\n\r\nذرائع کا کہنا ہے کہ معاون خصوصی برائے پیٹرولیم ندیم بابر کابینہ کمیٹی ادارہ جاتی اصلاحات میں بطور رکن شامل ہیں۔\r\n\r\nذرائع کہتے ہیں کہ حکومت کی قانونی ٹیم آئندہ حکمت عملی پر کل غور کرےگی اور وزیراعظم کو اس حوالے سے بریفنگ دی جائے گی', 'Politics', '236730_5677114_updates.jpg'),
(84, 'شیخوپورہ: ڈکیتی مزاحمت پرتاجر قتل، ڈاکو 5 لاکھ 60 ہزار روپے لیکر فرار', 'شیخوپورہ: جی ٹی روڈ پر ڈاکوؤں نے نوجوان تاجر کو ڈکیتی مزاحمت پر قتل کردیا اور 5 لاکھ 60 ہزار روپے چھین کر فرار ہوگئے۔\r\n\r\nپولیس کے مطابق شیخوپورہ جی ٹی روڈ  پر رچناٹا ؤن میں ایک نوجوان تاجر زاہد حبیب کو  ڈاکوؤں نے گلے میں رسی ڈال کر قتل کیا اور لاش ریلوے لائن پر پھینک دی۔\r\n\r\nپولیس کا کہناہےکہ ڈاکو تاجر کے 5 لاکھ 60 ہزار روپے چھین کر فرار ہوگئے جب کہ لاش ریلوے لائن پر پھینکنے سے ٹرین مقتول کی ٹانگوں پر سے گزر گئی۔\r\n\r\nپولیس کےمطابق مقتول اپنے والدکے ساتھ بھٹوں کوکوئلوں کی سپلائی کاکام کرتا تھا، مقتول کے والدکی مدعیت میں مقدمہ درج کرلیا گیا ہے۔', 'Mixed', '236853_4183515_updates.jpg'),
(85, 'میکے جانے کی اجازت نہ ملنے پر خاتون نے خودکشی کرلی', 'پولیس کے مطابق کنویں سے 22 سالہ  خاتون کی لاش ملنے کا واقعہ تھر پارکر کی تحصیل اسلام کوٹ کےگاؤں پریمے کی ڈانی میں پیش آیا۔\r\n\r\nپولیس کا کہنا ہے کہ لڑکی نے میکے جانے کی خواہش کی تھی تاہم شوہر کی جانب سے انکار کرنے پر دل برداشتہ ہوگئی اور گھر کے قریب کنویں میں چھلانگ لگا کرمبینہ طور پرخودکشی کرلی۔\r\n\r\nپولیس کے مطابق خاتون کی لاش کو اسلام کوٹ اسپتال منتقل کر دیا گیا ہے جہاں  پوسٹ مارٹم کے بعد مزید تحقیقات کی جائے گی۔\r\n\r\nمحکمہ پولیس تھرپارکر کے مطابق اس واقعے کے بعد رواں سال خود کشی کرنے والوں کی تعداد 115 ہو گئی ہے۔', 'Mixed', '236959_7773845_updates.jpg'),
(86, 'مولانا طارق جمیل بھی کورونا کا شکار، اسپتال میں داخل', 'معروف اسکالر مولانا طارق جمیل میں بھی کورونا وائرس کی تشخیص ہوئی ہے۔\r\n\r\nسوشل میڈیا پر بیان میں طارق جمیل کا کہنا تھا کہ گزشتہ کچھ ایام سے طبعیت ناساز تھی جس کے باعث ٹیسٹ کرایا تو کورونا پازیٹو آیا ہے۔\r\n\r\nانہوں نے کہا کہ ڈاکٹروں کے مشورے کے بعد اسپتال میں داخل ہوگیا ہوں اور تمام عوام سے دعاؤں کی درخواست ہے۔\r\n\r\nخیال رہے کہ ملک میں کورونا وائرس کی دوسری لہر جاری ہے اور کورونا کیسز میں تیزی سے اضافہ ہورہا ہے۔', 'Latest_News', '758096_8480433_tariq-jameel-coronavirus_updates.jpg'),
(87, 'لاہور جلسہ: مریم نواز سمیت پی ڈی ایم کی مرکزی قیادت کیخلاف مقدمہ درج', 'لاہور: مينارپاکستان جلسے پر  پی ڈی ايم کی مرکزی قيادت کے خلاف مقدمہ درج کرلیا گیا۔\r\n\r\nجیونیوز کے مطابق مقدمے ميں مريم نواز، خواجہ سعد رفيق ، احسن اقبال ، شاہد خاقان،  رانا ثنا اللہ اور  مريم اورنگزيب کو بھی نامزد کیا گیا ہے۔\r\n\r\nاس کے علاوہ رانا تنویر ،خواجہ آصف، طلال چوہدری،  ایاز صادق، ملک پرویز، رانا مبشر اقبال،  شیخ روحیل اصغر، سمیع اللہ خان،افضل کھوکھر  اور  سیف الملوک سمیت دیگر رہنما بھی ایف آئی آر میں نامزد ہیں۔\r\n\r\nمقدمہ سکیورٹی آفیسر پی ایچ اے کی مدعیت میں تھانہ لاری اڈا میں درج کرایاگیا ہے جس میں کورونا ايس او پيز کی خلاف ورزی اور ساؤنڈ سسٹم ايکٹ سميت 15 دفعات شامل کی گئی ہیں۔\r\n\r\nایف آئی آر میں کہا گیا ہےکہ جلسے کے شرکا نے قومی ورثے کی حرمت کو ناقابل تلافی نقصان پہنچايا۔\r\n\r\nایف آئی آر میں مزید کہا گیا ہےکہ  پی ڈی ایم انتظامیہ پارک کا گیٹ اور جنگلے توڑ کر پارک میں داخل ہوئی،  ملک وسیم کھوکھر 125 افراد کے ہمراہ مزاحمت کرکے پارک میں داخل ہوئے جب کہ فلیکسز اور سرچ لائٹس لگانے کے لئے فرش اور ٹریک کی ٹائلیں توڑی گئیں۔', 'Politics', '758041_5695094_PDM_updates.jpg'),
(88, 'سانحہ آرمی پبلک اسکول کو 6 برس بیت گئے، قوم کا غم آج بھی تازہ', 'انسانیت سوز اور دل دہلا دینے والے سانحہ آرمی پبلک اسکول کو 6 برس بیت گئے لیکن اس سانحے کو یاد کرکے قوم کا غم آج بھی تازہ ہے۔\r\n\r\n 6 سال قبل علم دشمنوں نے معصوم بچوں کو دہشتگردی کا نشانہ بنایا تھا اور 16 دسمبر 2014 کو مہاجرین کے روپ میں پاکستان داخل ہونے والے سفاک دہشتگردوں نے مقامی افراد کی مدد سے آرمی پبلک سکول پر حملہ کیا تھا اور حصول علم میں مگن بچوں پر فائرنگ کر دی۔\r\n\r\nواقعے کی اطلاع ملتے ہی سکیورٹی فورسز نے اسکول کا گھیراؤ کیا اور خود کار اسلحے سے لیس کالعدم تحریک طالبان پاکستان کے 6 خود کش حملہ آوروں کو طویل آپریشن کے بعد ہلاک کیا تھا۔\r\n\r\n6 گھنٹے سے زیادہ کے آپریشن کے بعد اسکول کو کلئیر کیا گیا، سانحہ اے پی ایس میں بچوں سمیت 130 سے زیادہ افراد شہید ہوئے تھے۔\r\n\r\nاس واقعے نے دہشتگردی کے خلاف جنگ میں نئی روح پھونک دی جس کے بعد حکومت اور دیگر اداروں نے مل کر نیشنل ایکشن پلان بنایا اور شمالی وزیرستان میں آپریشن ضرب عضب کے ذریعے دہشتگردوں کا صفایا کیاگیا۔ \r\n\r\nدل خراش واقعے میں اپنے جگر گوشے کھونے والے اپنے بچھڑے پیاروں کو یاد کرتے ہیں تو آنسو ہیں کہ رکنے کا نام نہیں لیتے تاہم جب انہیں شہدا کے حوالے سے یاد کیا جاتا ہے تو وہ خود کو ممتاز سمجھتے ہیں۔\r\n\r\nجہاں ملک سے دہشتگردی کا خاتمہ شہدا آرمی پبلک سکول کی قربانیوں کی بدولت ممکن ہوا وہیں تعلیم دشمن عناصر کے عزائم بھی خاک میں مل گئے۔', 'Mixed', 'df7cfc0db8a4bd27835d66ad801935b4.jpg'),
(89, 'کراچی: کورونا کیسز میں اضافہ، ضلع وسطی میں 31 دسمبر تک اسمارٹ لاک ڈاؤن نافذ', 'کراچی میں کورونا کی دوسری لہر کے پیش نظر ضلعی انتظامیہ کی جانب سے ایک ضلع میں 31 دسمبر تک اسمارٹ لاک ڈاون جبکہ دیگر اضلاع کے ہارٹ اسپارٹ کی نشاندہی کر دی گئی ہے۔\r\n\r\nڈپٹی کمشنر ضلع وسطی کی جانب سے اسمارٹ لاک ڈاؤن ڈسٹرک ہیلتھ افسر کی سفارشات پر لگایا جا رہا ہے۔\r\n\r\nمتعلقہ علاقوں میں اسمارٹ لاک ڈاؤن کے تحت صرف میڈیکل اسٹورز، پرچون اور دودھ کی دکانیں کھلی رہیں گی، اسمارٹ لاک ڈاؤن 17 سے 31 دسمبر تک جاری رہے گا۔\r\n\r\nاسمارٹ لاک ڈاؤن کے دوران متعلقہ علاقوں میں ڈبل سواری، ریسٹورینٹس پر ٹیک اوے اور ڈیلوری پر پابندی ہو گی جبکہ تجارتی مراکز، پارکس، پبلک ٹرانسپورٹ بھی بند رہے گی۔\r\n\r\nاس کے علاوہ ڈسٹرکٹ ایسٹ میں 21 کورونا ہاٹ اسپاٹ کی نشاندہی کی گئی ہے۔\r\n\r\nضلعی انتظامیہ کے مطابق متاثرہ علاقوں کی مجموعی آبادی 27 ہزار سے زائد ہے جہاں کورونا کیسز کی تعداد 446 ہے۔\r\n\r\nڈسٹرکٹ ایسٹ میں سب سے زیادہ 79 کورونا کیسز گلشن اقبال بلاک 6 میں ہیں۔\r\n\r\nڈسٹرکٹ ویسٹ میں کورونا کے 14 ہاٹ اسپاٹ کی نشاندہی کی گئی ہے، متاثرہ علاقوں کی مجموعی آبادی 24371 اور کورونا مریضوں کی تعداد 163 ہے۔\r\n\r\nڈسٹرکٹ کورنگی میں سب سے زیادہ 22 کورونا ہاٹ اسپاٹ کی نشاندہی کی گئی ہے، ڈسٹرکٹ کورنگی کے متاثرہ علاقوں کی مجموعی آبادی 44435 ہے۔\r\n\r\nاسی طرح ڈسٹرکٹ ملیر میں کورونا ہاٹ اسپاٹ کی تعداد 13 ہے، ملیر کے متاثرہ علاقوں کی مجموعی آبادی 20928 جبکہ کورونا مریضوں کی تعداد 215 ہے۔\r\n\r\nدسٹرکٹ ساؤتھ میں بھی 21 کورونا ہاٹ اسپاٹ کی نشاندہی کی گئی ہے جہاں متاثرہ علاقوں کی آبادی 27081 اور مریضوں کی تعداد 541 ہے۔', 'Health', '237590_7516358_updates.jpg'),
(90, 'گلوکارہ میشا شفیع کی قانونی ٹیم کا کہنا ہے کہ  عدالتی فیصلہ آنے تک میشا شفیع کو قصوروار نہیں ٹھہرایا جاسکتا۔', 'میشا شفیع کی قانونی ٹیم کے مطابق وفاقی تحقیقاتی ادارے کی رپورٹ انتہائی گمراہ کن ہے کیونکہ عدالت نےابھی فیصلہ نہیں سنایا بلکہ ابھی تو ٹرائل ہی شروع نہیں ہوا۔\r\n\r\n قانونی ٹیم کا کہنا ہے کہ میشا شفیع کے خلاف ابھی عدالت میں کیس نہیں چلا، عدالتی فیصلہ آنے تک میشا شفیع کو قصوروار نہیں ٹھہرایا جاسکتا۔\r\n\r\nقانون ٹیم کا کہنا ہےکہ کچھ حلقوں نے ایف آئی اے کے عبوری چالان کی غلط تشریح کی ہے جو میشا شفیع کی ساکھ کو نقصان پہنچانے کے لیے مہم چلا رہے ہیں۔\r\n\r\nقانونی ٹیم کے مطابق یہ بات باربار شیئربھی کی جا رہی ہے کہ میشا شفیع قصور وار ہیں، ایف آئی اے کی یہ رپورٹ انتہائی گمراہ کن ہے کیونکہ عدالت نےابھی فیصلہ نہیں سنایا۔\r\n\r\nقانونی ٹیم کا مزید کہنا تھاکہ میشا شفیع کیس طاقت کے استعمال کی ایک اور بدترین مثال ہے، ایک خاتون کو خاموش کرانے کے لیے قانون کو بطور ہتھیار استعمال کیا جارہا ہے۔', 'Latest_News', '237705_5268505_updates.jpg'),
(91, 'بلوچسان: خواتین ووٹرز کی تعداد مرد ووٹرز سے 14.72فیصد کم', 'کوئٹہ: الیکشن کمیشن نے بلوچستان اسمبلی کے 51 حلقوں کے ووٹرز کے اعداد و شمار جار ی کردیے۔\r\n\r\nالیکشن کمیشن آف پاکستان کے جاری کردہ اعداد وشمار کے مطابق بلوچستان اسمبلی کے کل 51حلقے ہیں جن میں رجسٹرڈ ووٹرز کی تعداد 48 لاکھ1131ہے ان میں سے بلوچستان اسمبلی کے انتخابی حلقوں میں مرد ووٹرز کی مجموعی تعداد 2754005 جب کہ خواتین رجسٹرڈووٹرز کی تعداد2047126 ہے۔', 'Latest_News', '238204_8187006_updates.jpg'),
(92, 'انسانی حقوق کی کارکن کریمہ بلوچ کی لاش ٹورانٹو سے برآمد', 'انسانی حقوق کی کارکن کریمہ بلوچ کی لاش کینیڈا کے شہر ٹورانٹو سے ملی ہے۔\r\n\r\nبرطانوی نشریاتی ادارے کی رپورٹ کے مطابق 37 سالہ انسانی حقوق کی کارکن کریمہ بلوچ گزشتہ 5 سال سے کینیڈا میں مقیم تھیں۔\r\n\r\nٹورانٹو پولیس نے اتوار کے روز ان کے لاپتہ ہونے پر لوگوں سے معلومات فراہم کرنے کی اپیل کی تھی تاہم اب پولیس نے تصدیق کی ہے کہ کریمہ بلوچ کی لاش انہیں ملی ہے۔\r\nپولیس کا کہنا ہے کہ اب تک ان کی موت کے حوالے سے کوئی مشکوک حالات و واقعات کے شواہد نہیں ملے ہیں۔\r\n\r\nدوسری جانب رہنماء بلوچ یکجہتی کمیٹی ماہ رنگ نے دیگر رہنماؤں کے ہمراہ کوئٹہ میں پریس کانفرنس کی اور کہا کہ کینیڈا میں بلوچ خاتون رہنما کریمہ بلو چ کا مبینہ قتل قابل مذمت ہے۔\r\n\r\nان کا مزید کہنا تھا کہ کریمہ بلوچ ایک روز قبل کینیڈا میں لاپتہ ہوگئی تھیں بعد میں ان کی لاش ملی،  کر یمہ بلوچ کا بیرون ملک قتل پہلا واقعہ نہیں ہے، اس سے پہلے سویڈن میں صحافی ساجد بلوچ کو بھی قتل کردیاگیا تھا۔\r\n\r\nانھوں نے کہاکہ کریمہ بلوچ کے مبینہ قتل کےخلاف ملک گیر احتجاج کیاجائےگا،  کریمہ بلوچ کے مبینہ قتل کے خلاف کل کوئٹہ اور حب میں احتجاجی ریلی نکالی جائےگی۔', 'Latest_News', '238315_529682_updates.jpg'),
(93, 'جرمنی میں پاکستانی نژاد نائب امام مسجد کو بے دردی سے قتل کردیا گیا', 'جرمنی میں ایک پاکستانی نژاد نائب امام مسجد کو ان کے گھر کے قریب نامعلوم حملہ آور نے قتل کردیا۔\r\n\r\nاطلاعات کے مطابق واقعہ جرمنی کے شہر اسٹٹ گارٹ میں پیش آیا۔ پاکستانی نژاد شاہد نواز قادری کے سر پر حملہ آور نے کوئی چیز ماری جس سے ان کی موت واقع ہوئی۔\r\n\r\nشاہد نواز مسجد المدینہ اسٹٹ گارٹ نائب خطیب تھے۔ حملہ آوروں کی شناخت اور حملہ کے محرکات معلوم نہیں ہوسکے ہیں۔\r\nاس حوالے سے جرمنی میں تعینات پاکستانی سفیر ڈاکٹر محمد فیصل نے بھی واقعے کی تصدیق کی ہے اور کہا ہے کہ جاں بحق ہونے والا شخص پاکستانی شہری تھا جسے 21 دسمبر کو قتل کیا گیا۔\r\n\r\nانہوں نے کہا کہ پولیس معاملے کی تحقیقات کررہی ہے اور حملہ آور کی تلاش تاحال جاری ہے۔\r\n\r\nڈاکٹر فیصل نے کہا کہ انہوں نے فرینکفرٹ کے قونصل جنرل کو مقتول کے اہل خانہ سے ملاقات اور ہر ممکن تعاون کے لیے بھیجا ہے اور وہ پولیس سے بھی ملاقات کریں گے۔', 'Latest_News', '238446_8719763_updates.jpg'),
(94, '’برطانیہ سے کورونا کی نئی قسم پاکستان آنے کے کوئی سائنسی شواہد نہیں‘', 'اسلام آباد: پارلیمانی سیکرٹری صحت نے بھی سائنسی شواہد کی بنیاد پر کورونا کی نئی قسم کی پاکستان میں موجودگی کی تردید کردی۔\r\n\r\nجیو نیوز کے پروگرام ’جیو پاکستان‘ میں گفتگو کرتےہوئے پارلیمانی سیکرٹری صحت ڈاکٹر نوشین حامد نے کہا کہ ابھی سائنسی شواہد نہیں کہ برطانیہ سے کوروناکا وائرس پاکستان آیاہو، حالیہ دنوں میں برطانیہ سے آئے افرادکا ڈیٹا مقامی انتظامیہ اور ڈپٹی کمشنرزکو دے دیا گیا ہے، برطانیہ سے آئے افرادکو ٹریس کرکے ٹیسٹ کیا جارہا ہے، بہت سارےلوگ ٹریس ہوگئے ہیں اور ان کےٹیسٹ کیے جارہے ہیں۔\r\n\r\nویکسین سےمتعلق انہوں نے بتایا کہ کورونا ویکسین حکومت منگوائے گی جس کے لیے 150 ملین ڈالر مختص کیے ہیں، ویکسین محکمہ صحت کے پروفیشنلز کو مفت لگائی جائے گی جب کہ حکومت جو ویکسین منگوائے گی وہ عوام کو بھی بالکل مفت دی جائے گی۔\r\n\r\nنوشین حامد کا کہنا تھا کہ پرائیوٹ سیکٹر کو بھی ویکسین منگوانے کی اجازت دی گئی ہے، پرائیوٹ سیکٹرکے ذریعےمنگوائی گئی ویکسین بھی کم دام میں ملے گی۔\r\n\r\nپارلیمانی سیکرٹری نے کہا کہ ویکسین سازکمپنیوں کا اندازہ یہی ہے کہ ویکسین وائرس کی نئی شکل پربھی مؤثر ہوگی۔', 'Latest_News', '238848_3542894_updates.jpg'),
(95, 'لاہور عقیل ملک سے لاہور کے علاقہ نصیرآباد آخری منٹ سٹاپ باغبان پورہ کے رہائشی ندیم نامی شخص پر کچھ بااثر افراد کا تشدد بااثر افراد میں محمد شاہد اور براق احمد ندیم کا پیچھا کرتا ہوں کرتے ہوئے اس کے گھر پہنچے اور ساتھ ہی مار کٹائی شروع کر دیں', 'لاہور عقیل ملک سے لاہور کے علاقہ نصیرآباد آخری منٹ سٹاپ باغبان پورہ کے رہائشی ندیم نامی شخص پر کچھ بااثر افراد کا تشدد بااثر افراد میں محمد شاہد اور براق احمد ندیم کا پیچھا کرتا ہوں کرتے ہوئے اس کے گھر پہنچے اور ساتھ ہی مار کٹائی شروع کر دیں اسی اثنا میں ملزمان نے ندیم نامی شخص پر فائرنگ کرنا شروع کر دیں فائر ندیم کو چھوتا ہوا دروازے پر لگا اور للکارہ مارتے ہوئے وہاں سے چلے گئے ندیم نے ون فائیو پر کال کی جس پر متعلقہ پولیس نے موقع پر پہنچ کر شواہد اکٹھے کر لئے اور ندیم کا میڈیکل کروانے کے لیے ہسپتال لے گئے لیکن دس روز گزر جانے کے باوجود پولیس کاروائی کرنے سے گریزاں ہے ندیم نامی شخص کی وزیراعلی پنجاب اور آئی جی پنجاب سے فوری انصاف فراہم کرنے کی اپیل ہے اور ملزمان کو کیفر کردار تک پہنچایا جائے', 'Latest_News', 'WhatsApp_Image_2020-12-28_at_10_56_24_AM.png'),
(96, 'کراچی میں ملزمان باڑے سے 9 بچھڑے چھین کر لے گئے', 'کراچی: سائٹ سپر ہائی وے کے علاقے میں نامعلوم ملزمان باڑے سے 9 بچھڑے چھین کر فرار ہو گئے۔\r\n\r\nپولیس کے مطابق سائٹ سپرہائی وے جنجال گوٹھ میں مویشی چھیننے کی واردات ہوئی اور  4 ملزمان ایک پلاٹ سے 9 بچھڑے چھین کر لے گئے۔\r\n\r\nپولیس نے بتایا کہ ملزمان اپنے ہمراہ منی ٹرک لائے تھے جس میں وہ 9 بچھڑے لاد کر فرار ہوگئے۔\r\n\r\nپولیس کے مطابق پلاٹ میں 19 جانور موجود تھے جب کہ چھینے گئے بچھڑوں کی مالیت لاکھوں روپے ہے', 'Latest_News', '238969_6774113_updates.jpg'),
(97, 'لاہور(کرائم رپورٹر رانا زاہد) ایس پی اقبال ٹاؤن کیپٹن(ر)محمداجمل کی ہدایت نیوائیر نائٹ کے حوالے سے عوام کیلئے آگاہی مہم۔اقبال ٹاؤن ڈویژن عوام کی آگاہی کیلئے نواں کوٹ۔شیراکوٹ۔سمن آباد۔ملت پارک سمیت ڈویژن میں پمفلٹ تقسیم ۔عوام الناس کوہدایت نامے پر عمل کرنے کی اپیل گئی ہے', 'لاہور(کرائم رپورٹر رانا زاہد) ایس پی اقبال ٹاؤن کیپٹن(ر)محمداجمل کی ہدایت نیوائیر نائٹ کے حوالے سے عوام کیلئے آگاہی مہم۔اقبال ٹاؤن ڈویژن عوام کی آگاہی کیلئے نواں کوٹ۔شیراکوٹ۔سمن آباد۔ملت پارک سمیت ڈویژن میں پمفلٹ تقسیم ۔عوام الناس کوہدایت نامے پر عمل کرنے کی اپیل گئی ہے موٹرسائیکل مکینک آٹو ورکشاپس کو بھی ون ویلنگ کے حوالے سے آگاہی مہم کا حصہ بنایا گیا۔آگاہی مہم کیلئے سوشل میڈیا سمیت تمام وسائل بروئے کار لائے جارہے ہیں۔ون ویلنگ۔ہوائی فائرنگ۔پتنگ بازی سے اپنے بچوں کو دور رکھیں۔کورونا وباء کے پیش نظر ایس او پیز پر بھی عمل درآمد کو یقینی بنایا جا رہا ہے۔گاڑیوں ۔موٹرسائیکلز کی حفاظت کیلئے ضروری اقدامات بھی آگاہی مہم کا حصہ.گاڑیوں ۔موٹرسائیکلز کو وائرلاک۔ہینڈل لاک لگاکر کھڑی کریں۔جرائم پیشہ افراد کے خلاف پولیس کو فوری اطلاع کریں۔جرائم کے خاتمہ کیلئے لاہور پولیس کا ساتھ دیں.اپنے اردگرد مشکوک اشخاص اور لاوارث اشیاء پر نظر رکھیں۔لاہور پولیس عوام کی خدمت اور مدد کیلئے ہر وقت حاضر ہے ۔۔ایس پی اقبال ٹاؤن کیپٹن(ر)محمداجمل', 'Latest_News', 'WhatsApp_Image_2020-12-29_at_11_25_48_AM_(1).png'),
(98, '(لاہور(کرائم رپورٹ', 'لاہور(کرائم رپورٹر رانا زاہد)\r\n*لاہور پولیس قبضہ مافیا اور سوشل میڈیا پر اسلحہ کی نمائش کرنے والے عناصر کے خلاف متحرک*\r\n\r\nایس پی کینٹ صاعد عزیز کی ہدایت پر باٹا پور پولیس کی بڑی کاروائی\r\n\r\nبزرگ شہری کی دوکان پر قبضہ کی کوشش کرنے والے دو ملزمان گرفتار۔ایس پی کینٹ اپریشنز\r\nسوشل میڈیا پر ناجائز اسلحہ کی تشہیر کرنے والا ملزم اورنگ زیب گرفتار، صاعد عزیز\r\n\r\nملزم اورنگ زیب خود کو ایلیٹ فورس کا جعلی ملازم ظاہر کرتا تھا۔ایس پی کینٹ\r\n\r\nملزم ایلیٹ فورس کے یونیفارم میں اسلحہ سمیت تصاویر سوشل میڈیا پر اپ لوڈ کرتا تھا۔ایس پی کینٹ\r\nملزمان سر عام اسلحہ کی نمائش کرکے علاقے میں دہشت اور خوف و ہراس پھیلاتے تھے۔ایس پی کینٹ\r\n\r\nملزمان کے قبضہ ناجائز اسلحہ اور گولیاں برامد، مقدمہ درج۔ صاعد عزیز\r\n\r\nقبضہ مافیا اور شو آف ویپن  کے خلاف زیرو ٹالرنس پالیسی پر عمل پیرا ہیں۔ایس پی کینٹ صاعد عزیز', 'Latest_News', 'IMG-20201229-WA0095.jpg'),
(99, 'حکومت نے مفتی منیب الرحمان کو مرکزی رویت ہلال کمیٹی سے نکال دیا', 'وفاقی حکومت نے مرکزی رویت ہلال کمیٹی کی تشکیل نو کر دی ہے۔\r\n\r\nوفاقی وزرات مذہبی امور  کی جانب سے جاری نوٹیفکیشن کے مطابق مرکزی رویت ہلال کمیٹی چیئرمین سمیت 19 ارکان پر مشتمل ہو گی جبکہ مولانا عبدالخبیر آزاد کو چیئرمین رویت ہلال کمیٹی مقرر کیا گیا ہے۔\r\n\r\n کمیٹی  میں ڈاکٹر راغب حسین نعیمی، علامہ محمد حسین اکبر، مولانا فضل الرحیم، ڈاکٹر یاسین ظفر، مفتی محمد اقبال چشتی اور ڈاکٹر مفتی علی اصغر شامل ہوں گے۔\r\n\r\n\r\n— فوٹو: سوشل میڈیا \r\nمفتی فیصل احمد، سید علی قرار نقوی اور مفتی یوسف کشمیری کو مرکزی رویت ہلال کمیٹی کا رکن مقرر کیا گیا ہے۔\r\n\r\nنوٹیفکیشن کے مطابق حافظ عبدالغفور، مفتی فضل جمیل رضوی، قاری میر اللہ، صاحبزادہ حبیب اللہ چشتی اور مفتی ضمیر ساجد بھی مرکزی رویت ہلال کمیٹی کے رکن ہوں گے۔\r\n\r\nمرکزی رویت ہلال کمیٹی میں سپارکو، محکمہ موسمیات کے نمائندے بھی شامل ہوں گے جبکہ وزارت سائنس و ٹیکنالوجی اور وزارت مذہبی امور کے  نمائندے بھی کمیٹی کا حصہ ہوں گے۔\r\n\r\nخیال رہے کہ اس سے قبل رویت ہلال کمیٹی کے چیئرمین مفتی منیب الرحمان تھے اور وہ طویل عرصے سے اس عہدے پر فائز تھے تاہم آج کمیٹی کی تشکیل نو میں ان سمیت متعدد ارکان کو نکال دیا گیا ہے۔', 'Latest_News', '283065_121254_updates.jpg'),
(100, '31 دسمبرکے بعد واٹس ایپ ان اسمارٹ فونز میں نہیں چلے گا', 'دنیا بھر میں مقبول پیغام رسانی اور ویڈیو کالنگ کی مقبول ترین ایپلیکیشن واٹس ایپ (WhatsApp)  کو پرانے آپریٹنگ سسٹمز والے اینڈرائڈ اور ایپل فونز کے صارفین 2021 میں استعمال نہیں کرسکیں گے۔\r\n\r\nرپورٹ کے مطابق فیس بک کی ملکیت واٹس ایپ کی جانب سے اعلان کیا گیا ہےکہ 31 دسمبر 2020 کے بعد جس  آئی فون کا آپریٹنگ سسٹم آئی او ایس سیون (iOS9) سے پرانا ہوگا اس پر واٹس ایپ کی سروس دستیاب نہیں ہوگی اور اسی طرح جس اسمارٹ فون میں  اینڈرائڈ 4.0.3 سے پرانا  آپریٹنگ سسٹم ہوگا وہ بھی واٹس ایپ کی سہولت سے مستفید نہیں ہوسکے گا۔\r\n\r\nواٹس ایپ کی جانب سے صارفین سےکہا گیا ہےکہ وہ بلاتعطل سروس کے لیے جدید ترین آپریٹنگ سسٹم اپنے اسمارٹ فونز میں اپ گریڈ کروالیں ۔\r\n\r\n رپورٹ کے مطابق آئی فون صارفین جن کے پاس  آئی فون 4ایس، آئی فون 5 اور 5 ایس، آئی فون 6 اور 6 ایس ہے وہ اپنے اسمارٹ فونز میں جلد ازجلد آئی او یس کا جدید ترین ورژن اپ گریڈ کرالیں یاکم ازکم iOS9 تو ضرور کروالیں ورنہ 31 دسمبر کے بعد وہ واٹس ایپ استعمال نہیں کرسکیں گے۔', 'Latest_News', '237532_965891_updates.jpg'),
(101, 'لاہور (عقیل ملک سے )سوئی ناردرن گیس کمپنی یونین سی بی اے کی جانب سے سیلز ڈیپارٹمنٹ کی قلم چھوڑ ہڑتال لاہور کے تمام دفاترز میں ایمپلائز یونین سی بی کی جانب سے ہڑتال کی کال دے دی گئی', 'لاہور (عقیل ملک سے )سوئی ناردرن گیس کمپنی یونین سی بی اے کی جانب سے سیلز ڈیپارٹمنٹ کی قلم چھوڑ ہڑتال لاہور کے تمام دفاترز میں ایمپلائز یونین سی بی کی جانب سے ہڑتال کی کال دے دی گئی دوران انکوائری ایف آئی اے کے آفیسر کی جانب سے سیلز ڈیپارٹمنٹ  کے  سینئر سپروائزر  کو گالم گلوچ کرنے عزت مجروح کرنے اور ہراساں کرنے پر سوئی گیس یونین سی بی اے کا گلبرگ اور لاہور کے تمام دفاتر میں سیلز پارلیمنٹ کی جانب سے  ہڑتال کا اعلان کردیا گیا ہے یونین کا کہنا ہے کہ انکوائری ضرور کریں لیکن عزت نفس کو مجروح کرنا ہراساں کرنا اور گالم گلوچ کرنےکی ہم شدید مذمت کرتے ہیں  دوسری جانب سوئی گیس انتظامیہ کی جانب سے احتجاج کرنے پر   انکوائری میں  شامل ایمپلائز کو فوری طور پر  معطل کرنے کا حکم دے دیا گیا۔  تفصیلات کے مطابق گزشتہ روز سوئی ناردرن گیس کمپنی کی سی بی اے یونین کی جانب سےسیلز پارلیمنٹ کی  قلم چھوڑ ہڑتال کا اعلان کرتے ہوئے گلبرگ سوئی گیس آفس میں احتجاج کرتے ہوئے ایمپلائز کا کہنا تھا کہ کچھ عرصہ پہلے لاہور کے علاقہ الرحمان گارڈن مناواں میں غیر قانونی گیس پائپ لائن پر درجنوں گھریلو گیس میٹرز ایف آئی اے کی جانب سے اور سوئی گیس یو ایف جی ڈیپارٹمنٹ کی جانب سے مشترکہ آپریشن کرتے ہوئے منقطع کئے گئے دوران انکوائری تفتیش کے سلسلے میں ایف آئی اے کی جانب سے پچیس سے تیس سوئی گیس ایمپلائز کو شامل کیا گیا سوئی گیس  ایمپلائز کی جانب سے جب ایف آئی حاضری دی گئی تو دوران تفتیش ایف آئی اے کےآفیسر نے ہمیں گالم گلوچ کی اور شدید ہراساں کیا ایمپلائز یونین کا کہنا تھا کہ تفتیش کرنا ریکارڈ طلب کرنا ایف آئی اے کا حق ہے لیکن گالم گلوچ کرنا عزت مجروح کرنا اور ہراساں کرنے کی ہم شدید مذمت کرتے ہیں ایمپلائز یونیین کا کہنا تھا کہ تفتیش ضرور کی جائے اور جو غیر قانونی اور کرپٹ مافیا ہے ان کے خلاف کارروائی بھی کی جائے لیکن دوران انکوائری کچھ ثابت کئے بغیر گالم گلوچ کرنا اور ہراساں کرنا غلط ہے جبکہ دوسری جانب  احتجاج کرنے پر سوئی گیس انتظامیہ کی جانب سے انکوائری میں شامل تمام ایمپلائز کو فوری طور پر معطل کر دیا گیا انکوائری مکمل ہونے تک کسی بھی ایمپلائے کو بحال نہیں کیا جائے گا چاہے وہ قصور وار ہے یا بے قصور جبکہ سی بی اے یونین کی جانب سے مکمل تعاون کی یقین دہانی کروانے کے باوجود سوئی گیس مینجمنٹ کی جانب سے انکوائری میں شامل تمام ایمپلائز کو معطل کرنے کا حکم دے دیا گیا ہے', 'Latest_News', 'WhatsApp_Image_2021-01-01_at_10_52_16_AM.jpg'),
(102, 'لاہور(کرائم رپورٹر رانا زاہد) ایس پی کینٹ صاعد عزیز کا پولیسنگ آف پولیس کے لیے اہم قدم', 'لاہور(کرائم رپورٹر رانا زاہد)\r\nایس پی کینٹ صاعد عزیز کا پولیسنگ آف پولیس کے لیے اہم قدم\r\n\r\nکینٹ ڈویژن کے تھانہ جات میں عرصہ دراز سے تعینات اہلکاروں کو تبدیل کر دیا گیا۔ ایس پی کینٹ\r\n\r\n 184 اہلکاروں کی جاۓ تعیناتی تبدیل کی گئی ہے۔ ایس پی کینٹ\r\n\r\nتبادلوں کا مقصد تھانہ لیول پر پولیس ورکنگ میں شفافیت پیدا کرنا ہے۔ایس پی کینٹ\r\n\r\nانتظامی امور کو بہتربنانے کے لیے مزید اقدامات کیے جائیں گے ۔ایس پی کینٹ\r\n\r\nتمام افسران واہلکاروں کو عوام کے ساتھ خوش اخلاقی سے پیش آنے کی ہدایت،\r\n\r\nجرائم کنٹرول کرنے کے ساتھ ساتھ کمیونٹی پولیسنگ کو بھی فروغ دیا جا رہا ہے۔۔ایس پی کینٹ صاعد عزیز', 'Latest_News', 'WhatsApp_Image_2021-01-01_at_11_04_40_AM.jpg'),
(103, 'سانحہ مچھ: کراچی کے 25 مقامات پر دھرنے، ٹریفک کا نظام درہم برہم', 'سانحہ مچھ کے خلاف کراچی میں 25 سے زائد مقامات پر دھرنے جاری ہیں جس سے شہر میں ٹریفک کا نظام درہم برہم ہے جب کہ شاہراہ فیصل اور گلستان جوہر کے راستے بند ہونے سے ائیرپورٹ آنے جانے والوں کو شدید مشکلات کا سامنا ہے۔\r\nاس کے علاوہ کورنگی کراسنگ اور سخی حسن پر بھی احتجاج کے باعث سڑکیں ٹریفک کے لیے بند ہیں۔\r\n\r\nناتھا خان، کالونی گیٹ، کامران چورنگی، جوہر موڑ،صفورا چورنگی، ابوالحسن اصفہانی روڈ، نیپا، سمامہ پل، ملیر 15، اسٹارگیٹ، پاور ہاؤس، انچولی اور فائیواسٹار چورنگی پر بھی احتجاج کیا جارہا ہے۔\r\n\r\nشہر میں ٹاور، عائشہ منزل، ناظم آباد 7 نمبر، ناظم آباد 1 نمبر، اسٹیل ٹاؤن چوک، کورنگی ڈھائی نمبر ،سرجانی کے ڈی اے فلیٹ، شاہ فیصل کالونی پل، ضیاالدین چورنگی، ناگن چورنگی اور پیپلز چورنگی پر بھی احتجاج کیا جارہا ہے۔\r\n\r\nشہر کے کئی مقامات پر جاری دھرنوں کی وجہ سے کراچی میں ٹریفک کا نظام درہم برہم ہوگیا۔\r\n\r\nشاہراہ فیصل اور گلستان جوہر پر دھرنوں کی وجہ سے ائیرپورٹ آنے اور جانے والوں کو شدید مشکلات کا سامنا ہے جب کہ ائیرپورٹ کے عملے کو بھی ڈیوٹی پر آنے میں مشکلات کی وجہ سے گزشتہ دو روز سے کئی پروازیں تاخیر کا شکار ہورہی ہیں۔', 'Latest_News', '240177_982606_updates.jpg'),
(104, 'حریم شاہ سے تھپڑ کھانے کے بعد مفتی قوی کا ردعمل سامنے آگی', 'ٹک ٹاک گرل حریم شاہ سے تھپڑ کھانے کے بعد معروف عالم دین اور رویت ہلال کمیٹی کے سابق رکن مفتی عبدالقوی کا ردعمل سامنے آگیا۔\r\n\r\nسوشل میڈیا پر ایک ویڈیو وائرل ہورہی ہے جس میں حریم شاہ نے مفتی عبدالقوی کو تھپڑ جڑدیا ہے۔\r\n\r\nبعدازاں حریم شاہ نے مفتی قوی کو تھپڑ مارنے کی تصدیق کی اور کہا کہ انہوں نے ہی تھپڑ مارا ہے اور کیوں مارا ہے اس کا جواب جلد سب کو مل جائے گا', 'Latest_News', '241643_2506419_updates.jpg'),
(105, 'پنجگور سے کراچی جانے والی مسافر کوچ کو حادثہ، 8 افراد جاں بحق اور 20 زخمی', 'حب کے علاقے بیلہ میں کوچ الٹنے سے 8 افراد جاں بحق اور 20 زخمی ہو گئے ۔\r\n\r\nریسکیو حکام کے مطابق پنجگور سے کراچی جانے والی مسافر کوچ کو حادثہ نمی چیک پوسٹ کے قریب پیش آیا، بس تیز رفتار سے چلائی جا رہی تھی اور ڈرائیور اس پر قابو نہ پا سکا۔\r\n\r\nریسکیو حکام کے مطابق جاں بحق ہونے والوں میں دو لیویز اہلکارں سمیت 2 بچے ایک خاتون اور 3 مرد شامل ہیں جب کہ حادثے کے زخمیوں کو طبی امداد کے لیے اسپتال منتقل کر دیا گیا ہے', 'Latest_News', '241812_8081062_updates.jpg'),
(106, 'ریاستِ مدینہ اور کوفہ کا گورنر', 'عباسی خلیفہ ابو جعفر المنصور نے اپنے زمانے کے ایک معروف محدث شریک بن عبداللہؒ سے فرمائش کی کہ وہ کوفہ کے قاضی بن جائیں۔ شریک بن عبداللہؒ نے امام ابو حنیفہؒ کی طرح معذرت کر لی۔\r\n\r\nمنصور نے امام ابو حنیفہؒ کا انکار برداشت نہیں کیا تھا لیکن اُس نے شریک بن عبداللہؒ سے سختی کرنے کی بجائے اصرار کیا کہ حکومت کو ایسے منصفوں کی ضرورت ہے جو اسلامی شریعت کے تقاضوں کے مطابق لوگوں کو جلد از جلد انصاف فراہم کر سکیں۔\r\n\r\nخلیفہ منصور کے اصرار پر شریک بن عبداللہؒ نے قاضی کا عہدہ قبول کر لیا۔ خلیفہ منصور کے انتقال کے بعد اُس کا بیٹا محمد مہدی مسند خلافت پر بیٹھا تو اُس نے بھی شریک بن عبداللہؒ کا عہدہ برقرار رکھا۔\r\n\r\nایک دفعہ شریک بن عبداللہؒ کی عدالت میں ایک عورت پیش ہوئی اور کوفہ کے گورنر موسیٰ بن عیسیٰ پر الزام لگایا کہ اُس نے میرے کھجوروں کے باغ کو مجھ سے زبردستی خریدنا چاہا جب میں نے انکار کر دیا تو اُس نے میرے باغ کی دیواریں گرا دیں تاکہ میں مجبور ہو کر اپنا باغ اُسے بیچ دوں۔ معاملہ کچھ یوں تھا کہ اس عورت کے باپ کا دریائے فرات کے کنارے کھجوروں کا ایک باغ تھا۔ باپ کے انتقال پر یہ باغ بہن بھائیوں میں تقسیم ہوا تو اس عورت نے اپنے حصے کے اردگرد دیوار بنا لی۔\r\n\r\nگورنر موسیٰ نے اس عورت کے بھائیوں سے یہ باغ خرید لیا لیکن یہ عورت اپنا حصہ گورنر کو فروخت کرنے سے انکاری تھی۔ وہ گورنر کی زور زبردستی سے نجات کے لئے قاضی شریک بن عبداللہؒ کو اپنی فریاد سنا چکی تو قاضی نے گورنر موسیٰ کو اپنی عدالت میں طلب کر لیا۔\r\n\r\nقاضی کا پیامبر طلبی کا حکم نامہ لے کر گورنر کے پاس پہنچا تو گورنر غصے میں آگ بگولہ ہو گیا۔ اُس نے اپنے ایک محافظ سے کہا کہ قاضی صاحب کے پاس جاؤ اور اُنہیں کہو کہ میرے منصب کا لحاظ کریں اور مجھے ایک جھوٹی عورت کے ساتھ کھڑا نہ کریں۔', 'Latest_News', '241925_1369517_updates.jpg'),
(107, 'فواد چوہدری کو نااہل قرار دینے کی درخواست سماعت کیلیے مقرر', 'اسلام آباد ہائیکورٹ نے اپنے گوشواروں میں اثاثے چھپانے کے الزام پر وفاقی وزیر برائے سائنس و ٹیکنالوجی فواد چوہدری کو نااہل قرار دینے کی درخواست یکم فروری کو سماعت کے لیے مقرر کر دی۔\r\n\r\nاسلام آباد ہائیکورٹ کے رجسٹرار آفس نے آئندہ ہفتے کے مقدمات کی کاز لسٹ جاری کر دی ہے جس کے مطابق فواد چوہدری کے نااہلی کیس کو یکم فروری کو سماعت کے لیے مقرر کیا گیا ہے، چیف جسٹس اطہر من اللہ درخواست گزار سمیع ابراہیم کی درخواست پر سماعت کریں گے۔\r\n\r\nعدالت نے درخواست پر فواد چوہدری اور الیکشن کمیشن آف پاکستان کو پہلے ہی نوٹس جاری کر کے جواب طلب کر رکھا ہے۔\r\n\r\nدرخواست میں فواد چوہدری پر اثاثے چھپانے کا الزام عائد کرتے ہوئے کہا گیا ہے کہ فواد چوہدری نے جہلم کی زمین کو اپنے گوشواروں میں ظاہر نہیں کیا، وہ صادق اور امین نہیں رہے اس لیے انہیں آئین کے آرٹیکل 62 ون ایف کے تحت نااہل قرار دیا جائے', 'Latest_News', '243093_3732412_updates.jpg'),
(108, 'پاکستان کو اس سال ایف اے ٹی ایف کی گرے لسٹ سے نکالے جانے کی قوی امید', 'پاکستان نے فنانشل ایکشن ٹاسک فورس(FATF) کو دہشتگردی، انتہاپسندی اور منی لانڈرنگ کے انسداد کے قابل ذکر اقدامات میں پیشرفت پر اپنی تازہ رپورٹ پیش بھجوا دی ہے۔\r\n\r\nسرکاری ذرائع کے مطابق پاکستان نے ایف اے ٹی ایف کے 27 نکات پر عملدرآمد مکمل کرنے اور باقی ماندہ 6 نکات پر جاری پیشرفت کو جلد مکمل کرنے کی یقین دہانی کروا دی ہے، پاکستان کو ایف اے ٹی ایف کی گرے لسٹ سے نکالے جانے سے متعلق اس سال اچھی خبر آنے کی قوی امید ہے۔\r\n\r\nذرائع نے جیو نیوز کو ایف اے ٹی ایف کےساتھ تازہ ترین رابطوں کے بارے میں بتایا ہےکہ پاکستان کا نام اسی سال گرے لسٹ سے نکلنے کے حوالے سے ایف اے ٹی ایف سے اچھی خبر آنے کی امید پیدا ہو گئی ہے۔\r\n\r\nذرائع کے مطابق پاکستان اور ایف اے ٹی ایف کے درمیان تقریباً دو تین ہفتے پہلے ایک روزہ فیس ٹو فیس مذاکرات بھی ہوئے جس میں پاکستانی وفد کی قیادت وفاقی وزیر حماد اظہر نے کی۔', 'Latest_News', '243187_9020307_updates.jpg'),
(109, '80 سالہ سابق وفاقی وزیر کی 21 سالہ لڑکی سے شادی کی تصاویر وائرل', 'سابق وفاقی وزیر و بزرگ سیاستدان سید افتخار حسین گیلانی نے 21 سالہ لڑکی سے شادی کرلی۔\r\n\r\nافتخار گیلانی 18 جولائی 1940 کو خیبرپختونخوا کے شہر کوہاٹ میں پیدا ہوئے ، انہوں نے اوائل میں ہی پیپلزپارٹی میں شمولیت اختیار کرلی تھی جبکہ بینظیر بھٹو کے پہلے دور حکومت میں  وزیر قانون رہے ہیں۔', 'Latest_News', '243468_6984934_updates.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `newspaper`
--

CREATE TABLE `newspaper` (
  `newspaper_id` int(200) NOT NULL,
  `newspaper_date` date NOT NULL,
  `newspaper_file` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `newspaper`
--

INSERT INTO `newspaper` (`newspaper_id`, `newspaper_date`, `newspaper_file`) VALUES
(5, '2021-01-04', 'Rozgar_news_(2).pdf'),
(6, '2020-12-28', 'Rozgar_news_(3).pdf'),
(7, '2021-01-06', 'Rozgar.pdf'),
(8, '2021-01-07', 'Daily_Rozgar_news.pdf'),
(9, '2021-01-08', 'Rozgar_news_(4).pdf'),
(10, '2021-01-12', 'Rozgar_news_(8).pdf'),
(11, '2021-01-16', 'Rozgar_news.pdf'),
(12, '2021-01-19', 'Rozgar1.pdf'),
(13, '2021-01-20', 'Rozgar_news1.pdf'),
(14, '2021-01-21', 'Rozgar_news_(1).pdf');

-- --------------------------------------------------------

--
-- Table structure for table `state`
--

CREATE TABLE `state` (
  `state_id` int(150) NOT NULL,
  `country_id` int(150) NOT NULL,
  `state_name` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `state`
--

INSERT INTO `state` (`state_id`, `country_id`, `state_name`) VALUES
(1, 1, 'Alabama'),
(2, 1, 'Alaska'),
(3, 1, 'Arizona'),
(4, 2, 'ontario'),
(5, 2, 'baritish colambia'),
(6, 3, 'Balochistan'),
(7, 3, 'Punjab'),
(8, 3, 'Khyber Pakhtunkhwa'),
(9, 4, 'Andhra Pradesh'),
(10, 4, 'Arunachal Pradesh');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(150) NOT NULL,
  `password` varchar(150) NOT NULL,
  `firstname` varchar(150) NOT NULL,
  `lastname` varchar(150) NOT NULL,
  `email` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `firstname`, `lastname`, `email`) VALUES
(1, 'admin', 'admin123', 'ADMIN', 'ADMIN', 'admin@gmail.com');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `city`
--
ALTER TABLE `city`
  ADD PRIMARY KEY (`city_id`);

--
-- Indexes for table `contact`
--
ALTER TABLE `contact`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `country`
--
ALTER TABLE `country`
  ADD PRIMARY KEY (`country_id`);

--
-- Indexes for table `feedback`
--
ALTER TABLE `feedback`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `newspaper`
--
ALTER TABLE `newspaper`
  ADD PRIMARY KEY (`newspaper_id`);

--
-- Indexes for table `state`
--
ALTER TABLE `state`
  ADD PRIMARY KEY (`state_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `city`
--
ALTER TABLE `city`
  MODIFY `city_id` int(150) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `contact`
--
ALTER TABLE `contact`
  MODIFY `id` int(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT for table `country`
--
ALTER TABLE `country`
  MODIFY `country_id` int(150) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `feedback`
--
ALTER TABLE `feedback`
  MODIFY `id` int(150) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `news`
--
ALTER TABLE `news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=110;

--
-- AUTO_INCREMENT for table `newspaper`
--
ALTER TABLE `newspaper`
  MODIFY `newspaper_id` int(200) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `state`
--
ALTER TABLE `state`
  MODIFY `state_id` int(150) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
